/*
 * ADSpinnaker.cpp
 *
 * This is a driver for FLIR (PointGrey) GigE, 10GigE, and USB3 cameras using their Spinnaker SDK
 *
 * Author: Mark Rivers
 *         University of Chicago
 *
 * Created: February 3, 2018
 *
 */

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include <set>

#include <epicsEvent.h>
#include <epicsTime.h>
#include <epicsThread.h>
#include <epicsMessageQueue.h>
#include <iocsh.h>
#include <cantProceed.h>
#include <epicsString.h>
#include <epicsExit.h>

#include "Spinnaker.h"
#include "SpinGenApi/SpinnakerGenApi.h"

using namespace Spinnaker;
using namespace Spinnaker::GenApi;
using namespace Spinnaker::GenICam;
using namespace std;

#include "ADDriver.h"

#include <epicsExport.h>

#define DRIVER_VERSION      1
#define DRIVER_REVISION     0
#define DRIVER_MODIFICATION 0

static const char *driverName = "ADSpinnaker";

/*
#define PGPacketSizeString            "PG_PACKET_SIZE"
#define PGPacketSizeActualString      "PG_PACKET_SIZE_ACTUAL"
#define PGMaxPacketSizeString         "PG_MAX_PACKET_SIZE"
#define PGPacketDelayString           "PG_PACKET_DELAY"
#define PGPacketDelayActualString     "PG_PACKET_DELAY_ACTUAL"
#define PGBandwidthString             "PG_BANDWIDTH"
#define PGTimeStampModeString         "PG_TIME_STAMP_MODE"
*/

// Default packet delay in microseconds
#define DEFAULT_PACKET_DELAY 400

// Size of message queue for callback function
#define CALLBACK_MESSAGE_QUEUE_SIZE 10

typedef enum {
    SPPropertyTypeInt,
    SPPropertyTypeBoolean,
    SPPropertyTypeEnum,
    SPPropertyTypeDouble,
    SPPropertyTypeDoubleMin,
    SPPropertyTypeDoubleMax,
    SPPropertyTypeString,
    SPPropertyTypeCmd,
    SPPropertyTypeUnknown
} SPPropertyType_t;

typedef enum {
    SPPixelConvertNone,
    SPPixelConvertMono8,
    SPPixelConvertMono16,
    SPPixelConvertRaw16,
    SPPixelConvertRGB8,
    SPPixelConvertRGB16
} SPPixelConvert_t;


/*
static const char *gigEPropertyTypeStrings[NUM_GIGE_PROPERTIES] = {
    "Heartbeat",
    "HeartbeatTimeout",
    "PacketSize",
    "PacketDelay"
};
*/

typedef enum {
    TimeStampCamera,
    TimeStampEPICS,
    TimeStampHybrid
} PGTimeStamp_t;

typedef enum {
    SPConvertToEPICS,
    SPConvertFromEPICS
} SPConvertDirection_t;


class ImageEventHandler : public ImageEvent
{
public:

    ImageEventHandler(epicsMessageQueue *pMsgQ) 
     : pMsgQ_(pMsgQ)
    {}
    ~ImageEventHandler() {}
  
    void OnImageEvent(ImagePtr image) {
        static ImagePtr imageCopy;
        imageCopy = image;
  
        if (pMsgQ_->send(&imageCopy, sizeof(imageCopy)) != 0) {
            printf("OnImageEvent error calling pMsgQ_->send()\n");
        }
    }
  
private:
    epicsMessageQueue *pMsgQ_;

};

/** Main driver class inherited from areaDetectors ADDriver class.
 * One instance of this class will control one camera.
 */
class ADSpinnaker : public ADDriver
{
public:
    ADSpinnaker(const char *portName, int cameraId, int traceMask, int memoryChannel,
                 int maxBuffers, size_t maxMemory,
                 int priority, int stackSize);

    // virtual methods to override from ADDriver
    virtual asynStatus writeInt32( asynUser *pasynUser, epicsInt32 value);
    virtual asynStatus writeFloat64( asynUser *pasynUser, epicsFloat64 value);
    virtual asynStatus readEnum(asynUser *pasynUser, char *strings[], int values[], int severities[], 
                                size_t nElements, size_t *nIn);
    void report(FILE *fp, int details);
    /**< These should be private but are called from C callback functions, must be public. */
    void imageGrabTask();
    void shutdown();

protected:
    int SPVideoMode;            // 0
#define FIRST_SP_PARAM SPVideoMode
    int SPFrameRate;            // 1 
    int SPFrameRateAuto;        // 2
    int SPFrameRateEnable;      // 3
    int SPExposureAuto;         // 5
    int SPGainAuto;             // 7
    int SPBlackLevel;           // 8
    int SPBlackLevelAuto;       // 9
    int SPBlackLevelBalanceAuto;// 10
    int SPSaturation;           // 11
    int SPSaturationEnable;     // 12
    int SPGamma;                // 13
    int SPGammaEnable;          // 14
    int SPSharpening;           // 15
    int SPSharpeningAuto;       // 16
    int SPSharpeningEnable;     // 17
    int SPPixelFormat;          // 18
    int SPConvertPixelFormat;   // 19
    int SPTriggerSource;        // 20
    int SPTriggerActivation;    // 21
    int SPTriggerDelay;         // 22
    int SPSoftwareTrigger;      // 23
    int SPBalanceRatio;         // 24
    int SPBalanceRatioSelector; // 25
    int SPBalanceWhiteAuto;     // 26
    int SPTransmitFailureCount; // 27
    int SPBufferUnderrunCount;  // 28
    int SPFailedBufferCount;    // 29
    int SPFailedPacketCount;    // 30

//    int PGPacketSize;             /** Size of data packets from camera                (int32 write/read) */
//    int PGPacketSizeActual;       /** Size of data packets from camera                (int32 write/read) */
//    int PGMaxPacketSize;          /** Maximum size of data packets from camera        (int32 write/read) */
//    int PGPacketDelay;            /** Packet delay in usec from camera, GigE only     (int32 write/read) */
//    int PGPacketDelayActual;      /** Packet delay in usec from camera, GigE only     (int32 read) */
//    int PGBandwidth;              /** Bandwidth in MB/s                               (float64 read) */
//    int PGTimeStampMode;          /** Time stamp mode (PGTimeStamp_t)                 (int32 write/read) */

private:
    class SPProperty {
        public:
            SPProperty(ADSpinnaker *pDrvIn, int asynParamIn, const char *nodeNameIn, SPPropertyType_t propertyType=SPPropertyTypeUnknown);
